app/controllers/stocks_controller.rb

SELECT "stocks".* FROM "stocks"
---
  def index
    @stocks = Stock.all

SELECT "stocks".* FROM "stocks" WHERE "stocks"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def set_stock
      @stock = Stock.find(params[:id])